In [1]:
import pandas as pd

#### Lets Start with Dictionary as Data Container

In [2]:
person = {
    "first": "Akshay", 
    "last": "Savaliya", 
    "email": "akshaysavaliya@gmail.com"
}
person

{'first': 'Akshay', 'last': 'Savaliya', 'email': 'akshaysavaliya@gmail.com'}

##### But here the Dictionary can store only one value for each key..
##### Lets go with list of values for each key

In [3]:
people = {
    "first": ["Akshay"], 
    "last": ["Savaliya"], 
    "email": ["akshaysavaliya@gmail.com"]
}

In [4]:
people = {
    "first": ["Kirtan", "Anirudh", "Darshit"], 
    "last": ["patel", "rana", "patel"], 
    "email": ["kirtanpatel@gmail.com", "Anirudhr@gmail.com", "darshitpatel@gmail.com"]
}

In [5]:
# access values of a specific key
people['email']

['kirtanpatel@gmail.com', 'Anirudhr@gmail.com', 'darshitpatel@gmail.com']

##### Problem with disctionary is: it has very limited functionalities.
##### Hence lets go to pandas and its data-frames

#### DataFrame: 2-D data structure (rows and columns)

In [6]:
df = pd.DataFrame(people)

In [7]:
df

     first   last                   email
0   Kirtan  patel   kirtanpatel@gmail.com
1  Anirudh   rana      Anirudhr@gmail.com
2  Darshit  patel  darshitpatel@gmail.com

In [8]:
# Access single column
df['email']

0     kirtanpatel@gmail.com
1        Anirudhr@gmail.com
2    darshitpatel@gmail.com
Name: email, dtype: object

##### The above printed object is a series

#### Series: 1-d array (rows of a single column)

#### Dataframe: Container for multiple series

In [9]:
type(df['email'])

pandas.core.series.Series

In [10]:
# Access single column other way
df.email

0     kirtanpatel@gmail.com
1        Anirudhr@gmail.com
2    darshitpatel@gmail.com
Name: email, dtype: object

In [11]:
# Access Multiple columns
df[['first','last']]

     first   last
0   Kirtan  patel
1  Anirudh   rana
2  Darshit  patel

In [12]:
# Knowing all columns of dataframe
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [13]:
df

     first   last                   email
0   Kirtan  patel   kirtanpatel@gmail.com
1  Anirudh   rana      Anirudhr@gmail.com
2  Darshit  patel  darshitpatel@gmail.com

#### To access rows loc and iloc are used

##### loc:  it is label-based
##### iloc: it is integer position-based

In [14]:
df.iloc[0]

first                   Kirtan
last                     patel
email    kirtanpatel@gmail.com
Name: 0, dtype: object

In [15]:
# Access Multiple rows
df.iloc[[0,1]]

     first   last                  email
0   Kirtan  patel  kirtanpatel@gmail.com
1  Anirudh   rana     Anirudhr@gmail.com

In [16]:
# Rows of specific columns only
df.iloc[[0, 1], 1]

0    patel
1     rana
Name: last, dtype: object

In [17]:
# Rows of specific columns only
df.iloc[[0, 1], [0,1]]

     first   last
0   Kirtan  patel
1  Anirudh   rana

##### Using loc

In [18]:
df

     first   last                   email
0   Kirtan  patel   kirtanpatel@gmail.com
1  Anirudh   rana      Anirudhr@gmail.com
2  Darshit  patel  darshitpatel@gmail.com

In [19]:
df.loc[0]

first                   Kirtan
last                     patel
email    kirtanpatel@gmail.com
Name: 0, dtype: object

In [20]:
df.loc[[0,1]]

     first   last                  email
0   Kirtan  patel  kirtanpatel@gmail.com
1  Anirudh   rana     Anirudhr@gmail.com

In [21]:
df.loc[[0,1], 'email']

0    kirtanpatel@gmail.com
1       Anirudhr@gmail.com
Name: email, dtype: object

In [22]:
df.loc[[0,1], ['email','last']]

                   email   last
0  kirtanpatel@gmail.com  patel
1     Anirudhr@gmail.com   rana

In [23]:
df.loc[[0,1], ['last','email']]

    last                  email
0  patel  kirtanpatel@gmail.com
1   rana     Anirudhr@gmail.com